{
    "id": "astro",
    "name": "Curso intensivo de Astro",
    "description": "Aprende Astro, un framework moderno para crear sitios web r치pidos, est치ticos y altamente optimizados 游깷.",
    "modulos": [
        {
            "id": 1,
            "title": "Introducci칩n a Astro",
            "description": "Conocer치s qu칠 es Astro, su historia y c칩mo instalarlo.",
            "lecciones": [
                {
                    "id": "a1",
                    "title": "쯈u칠 es Astro?",
                    "explicacion": "Astro es un framework moderno para construir sitios web r치pidos y optimizados, usando componentes que solo cargan el JavaScript necesario."
                },
                {
                    "id": "a2",
                    "title": "Historia y filosof칤a",
                    "explicacion": "Lanzado en 2021, Astro busca mejorar el rendimiento web con enfoque en contenido est치tico, eliminando la necesidad de cargar JavaScript innecesario."
                },
                {
                    "id": "a3",
                    "title": "Instalaci칩n y entorno",
                    "explicacion": "Se instala con `npm create astro@latest` y permite integraci칩n con frameworks como React, Vue o Svelte para componentes din치micos."
                }
            ],
            "video": "",
            "dato": "Astro optimiza autom치ticamente tu sitio, cargando solo lo necesario para mejorar velocidad y SEO."
        },
        {
            "id": 2,
            "title": "Estructura de un proyecto Astro",
            "description": "Aprender치s a organizar un proyecto Astro y conocer sus archivos y carpetas principales.",
            "lecciones": [
                {
                    "id": "b1",
                    "title": "Archivos y carpetas principales",
                    "explicacion": "Un proyecto Astro incluye `src/pages`, `src/components`, `public/` y `astro.config.mjs` para configurar el proyecto."
                },
                {
                    "id": "b2",
                    "title": "P치ginas y rutas",
                    "explicacion": "Cada archivo `.astro` dentro de `src/pages` se convierte en una ruta del sitio web, por ejemplo `src/pages/about.astro` genera `/about`."
                },
                {
                    "id": "b3",
                    "title": "Layouts y plantillas",
                    "explicacion": "Puedes crear layouts reutilizables en `src/layouts` para mantener consistencia en encabezados, pies de p치gina y estilos."
                }
            ],
            "video": "",
            "dato": "La estructura modular facilita mantenimiento y escalabilidad en proyectos Astro."
        },
        {
            "id": 3,
            "title": "Componentes y JSX/MDX",
            "description": "Aprender치s a crear componentes reutilizables y a integrar contenido din치mico.",
            "lecciones": [
                {
                    "id": "c1",
                    "title": "Componentes Astro",
                    "explicacion": "Se crean archivos `.astro` que exportan HTML, CSS y JavaScript encapsulados: `<Header />` y `<Footer />`."
                },
                {
                    "id": "c2",
                    "title": "Integraci칩n con frameworks",
                    "explicacion": "Astro permite usar React, Vue, Svelte o SolidJS dentro de componentes para partes din치micas de la web."
                },
                {
                    "id": "c3",
                    "title": "Uso de MDX",
                    "explicacion": "Astro soporta archivos MDX (`.mdx`) para mezclar Markdown con componentes React o Astro, ideal para blogs y documentaci칩n."
                }
            ],
            "video": "",
            "dato": "Astro combina contenido est치tico con componentes din치micos de manera eficiente."
        },
        {
            "id": 4,
            "title": "Estilos y assets",
            "description": "Aprender치s a aplicar estilos y manejar recursos est치ticos en Astro.",
            "lecciones": [
                {
                    "id": "d1",
                    "title": "CSS y preprocesadores",
                    "explicacion": "Astro soporta CSS, SCSS y TailwindCSS para dise침ar tus p치ginas de forma modular y eficiente."
                },
                {
                    "id": "d2",
                    "title": "Assets y optimizaci칩n",
                    "explicacion": "Se manejan im치genes, fuentes y scripts en `public/`. Astro optimiza autom치ticamente im치genes y recursos para mejorar velocidad de carga."
                },
                {
                    "id": "d3",
                    "title": "CSS Modules y scoped styles",
                    "explicacion": "Puedes usar CSS Modules para estilos locales: `import styles from './Header.module.css';` y aplicarlos solo al componente."
                }
            ],
            "video": "",
            "dato": "El manejo eficiente de estilos y assets mejora el rendimiento y la experiencia de usuario."
        },
        {
            "id": 5,
            "title": "Contenido din치mico y APIs",
            "description": "Aprender치s a obtener datos externos y mostrarlos en tu sitio Astro.",
            "lecciones": [
                {
                    "id": "e1",
                    "title": "Fetch de APIs",
                    "explicacion": "Puedes usar `fetch` dentro de componentes Astro para obtener datos en tiempo de construcci칩n: `const res = await fetch(url); const data = await res.json();`"
                },
                {
                    "id": "e2",
                    "title": "Data from Markdown",
                    "explicacion": "Astro permite usar archivos Markdown como fuente de contenido, ideal para blogs y documentaci칩n."
                },
                {
                    "id": "e3",
                    "title": "Integraci칩n con CMS",
                    "explicacion": "Se puede integrar con Headless CMS como Contentful, Strapi o Sanity para contenido din치mico en p치ginas est치ticas."
                }
            ],
            "video": "",
            "dato": "Astro combina contenido est치tico y din치mico para sitios web r치pidos y escalables."
        },
        {
            "id": 6,
            "title": "Optimizaci칩n y deployment",
            "description": "Aprender치s a optimizar tu sitio y publicarlo en producci칩n.",
            "lecciones": [
                {
                    "id": "f1",
                    "title": "Optimizaci칩n de rendimiento",
                    "explicacion": "Astro realiza renderizado est치tico, carga parcial de JS y optimizaci칩n de assets autom치ticamente para mejorar velocidad y SEO."
                },
                {
                    "id": "f2",
                    "title": "Build y exportaci칩n",
                    "explicacion": "Usa `npm run build` para generar el sitio est치tico listo para producci칩n. Los archivos se guardan en `dist/`."
                },
                {
                    "id": "f3",
                    "title": "Deployment",
                    "explicacion": "Puedes desplegar en Netlify, Vercel, GitHub Pages o cualquier servidor que sirva archivos est치ticos."
                }
            ],
            "video": "",
            "dato": "Astro facilita el deployment y asegura sitios web r치pidos, SEO-friendly y confiables."
        }
    ]
}
