{
  "id": "html",
  "name": "Curso Intensivo de HTML5 Profesional",
  "description": "Domina la base del desarrollo web moderno aprendiendo HTML5 desde sus fundamentos hasta sus aplicaciones más avanzadas. Comprende cómo estructurar contenido semántico, accesible y optimizado para SEO, con visión de estándares y buenas prácticas.",
  "modulos": [
    {
      "id": 1,
      "title": "Fundamentos y Contexto Histórico del Lenguaje HTML",
      "description": "Comprenderás la naturaleza, propósito y evolución de HTML como pilar del desarrollo web, reconociendo su rol dentro del ecosistema tecnológico actual.",
      "lecciones": [
        {
          "id": "a1",
          "title": "Qué es HTML y su propósito en la Web",
          "explicacion": "HTML (HyperText Markup Language) es el lenguaje estándar utilizado para estructurar y presentar contenido en la web. Define la semántica del contenido, permitiendo que los navegadores y los motores de búsqueda comprendan la jerarquía e intención de cada elemento dentro de un documento. Su propósito no es programar, sino organizar y describir información para ser interpretada visualmente y de forma accesible."
        },
        {
          "id": "a2",
          "title": "Cómo funciona un documento HTML",
          "explicacion": "HTML funciona mediante un sistema jerárquico de etiquetas (tags) que delimitan elementos. Cada elemento tiene una etiqueta de apertura y cierre, y puede contener atributos que modifican su comportamiento o aspecto. Estas etiquetas son interpretadas por el navegador para construir el DOM (Document Object Model), la representación estructurada del contenido visible y manipulable mediante CSS o JavaScript."
        },
        {
          "id": "a3",
          "title": "Aplicaciones y alcance del lenguaje",
          "explicacion": "HTML sirve como la base de toda página o aplicación web. Define el esqueleto sobre el cual se aplican estilos (CSS) y lógica (JavaScript). Es esencial en el diseño de interfaces, en el SEO técnico, en la accesibilidad (a través de etiquetas ARIA) y en la interoperabilidad entre plataformas digitales."
        },
        {
          "id": "a4",
          "title": "Evolución y estándares de HTML",
          "explicacion": "Desde HTML 1.0 hasta HTML5, el lenguaje ha evolucionado bajo la supervisión del W3C y WHATWG. HTML5 introdujo etiquetas semánticas, compatibilidad nativa con audio y video, API de Canvas, almacenamiento local y geolocalización, marcando un cambio hacia aplicaciones web más ricas e interactivas sin depender de complementos externos."
        }
      ],
      "image": "https://cdn1.iconfinder.com/data/icons/programing-development-7/24/html_html5_web_programing_developer-512.png",
      "video": "https://fwfnrpvtldgyvgorzwrp.supabase.co/storage/v1/object/public/Videos/html_1.mp4",
      "dato": "HTML no es un lenguaje de programación, sino de marcado. Su función es estructurar, describir y dar significado al contenido web."
    },
    {
      "id": 2,
      "title": "Estructura y Anatomía de un Documento HTML5",
      "description": "Aprenderás a construir la base de una página HTML5 profesional, comprendiendo la función de cada parte y cómo se comunican entre sí.",
      "lecciones": [
        {
          "id": "b1",
          "title": "Estructura semántica básica",
          "explicacion": "Todo documento HTML5 comienza con la declaración `<!DOCTYPE html>`, que indica al navegador el estándar del documento. A continuación, se define el elemento raíz `<html>`, dentro del cual se ubican dos secciones principales: `<head>` para metadatos y configuraciones, y `<body>` para el contenido visible."
        },
        {
          "id": "b2",
          "title": "El encabezado `<head>` y su relevancia técnica",
          "explicacion": "La sección `<head>` incluye información que no se muestra al usuario, pero es esencial para el rendimiento, accesibilidad y SEO del sitio. Aquí se declaran los metadatos (`<meta>`), el título (`<title>`), vínculos a recursos externos (`<link>`) y scripts que afectan el comportamiento global del documento."
        },
        {
          "id": "b3",
          "title": "El cuerpo `<body>` y el flujo de contenido",
          "explicacion": "El `<body>` contiene todo lo que el usuario visualiza o con lo que interactúa: texto, multimedia, formularios, botones, etc. Su estructura jerárquica y semántica define la accesibilidad del sitio y afecta directamente la experiencia del usuario."
        },
        {
          "id": "b4",
          "title": "Comentarios y legibilidad del código",
          "explicacion": "Los comentarios (`<!-- ... -->`) permiten documentar el código, describir secciones o desactivar temporalmente bloques de contenido. Un código bien comentado mejora la colaboración entre desarrolladores y la mantenibilidad del proyecto."
        }
      ],
      "video": "",
      "dato": "La correcta estructura del documento HTML es esencial para la compatibilidad entre navegadores, la optimización SEO y la accesibilidad digital."
    },
    {
      "id": 3,
      "title": "Etiquetas Fundamentales y Organización del Contenido",
      "description": "Domina las etiquetas esenciales para estructurar texto, imágenes, enlaces, tablas y listas de forma semántica y profesional.",
      "lecciones": [
        {
          "id": "c1",
          "title": "Jerarquía de encabezados y párrafos",
          "explicacion": "Los encabezados (`<h1>` a `<h6>`) establecen una jerarquía informativa. El `<h1>` define el tema principal y solo debe usarse una vez por página. Los párrafos (`<p>`) organizan texto en bloques lógicos. Esta estructura mejora la legibilidad y optimiza el SEO."
        },
        {
          "id": "c2",
          "title": "Enlaces y navegación hipertextual",
          "explicacion": "Los enlaces (`<a href='...'>`) permiten conectar documentos y recursos. Pueden apuntar a páginas externas, internas o secciones dentro del mismo documento (`#id`). Usar el atributo `target='_blank'` abre el enlace en una nueva pestaña, pero debe usarse con precaución."
        },
        {
          "id": "c3",
          "title": "Imágenes y recursos multimedia",
          "explicacion": "El elemento `<img>` inserta imágenes y requiere el atributo `alt` para describir el contenido, mejorando la accesibilidad. También es recomendable usar formatos optimizados (WebP, AVIF) y atributos como `loading='lazy'` para mejorar el rendimiento."
        },
        {
          "id": "c4",
          "title": "Listas y organización jerárquica de datos",
          "explicacion": "Las listas ordenadas (`<ol>`) y no ordenadas (`<ul>`) agrupan información secuencial. Cada elemento se define con `<li>`. HTML también incluye listas de definición (`<dl>`, `<dt>`, `<dd>`) útiles para glosarios o pares término-definición."
        },
        {
          "id": "c5",
          "title": "Tablas y datos estructurados",
          "explicacion": "Las tablas (`<table>`, `<tr>`, `<th>`, `<td>`) presentan datos en formato tabular. HTML5 promueve su uso exclusivamente para información estructurada, no para diseño visual. Es recomendable aplicar atributos como `scope` y `caption` para mejorar la accesibilidad."
        }
      ],
      "video": "",
      "dato": "El correcto uso de etiquetas semánticas diferencia a un HTML principiante de uno profesional, mejorando la accesibilidad y el SEO."
    },
    {
      "id": 4,
      "title": "Formularios y Experiencia de Usuario (UX)",
      "description": "Aprenderás a diseñar formularios accesibles, funcionales y estéticamente coherentes con las prácticas modernas de diseño web.",
      "lecciones": [
        {
          "id": "d1",
          "title": "Estructura de un formulario",
          "explicacion": "Los formularios (`<form>`) permiten la recolección de datos mediante elementos de entrada. Se conectan con scripts del servidor (PHP, Node.js, etc.) o APIs para procesar la información. Los atributos `action` y `method` (`GET`, `POST`) definen su comportamiento."
        },
        {
          "id": "d2",
          "title": "Controles de entrada modernos",
          "explicacion": "HTML5 introdujo nuevos tipos de `<input>` como `email`, `date`, `color`, `number` y `range`. Estos mejoran la validación automática y la experiencia del usuario en dispositivos móviles."
        },
        {
          "id": "d3",
          "title": "Selección y agrupación de opciones",
          "explicacion": "Los campos `checkbox`, `radio` y `select` permiten seleccionar opciones individuales o múltiples. Agruparlos con `<fieldset>` y `<legend>` mejora la semántica y accesibilidad del formulario."
        },
        {
          "id": "d4",
          "title": "Etiquetas, validación y accesibilidad",
          "explicacion": "El uso correcto de `<label>` y los atributos `for` o `aria-label` mejora la accesibilidad. HTML5 también incluye validaciones nativas (`required`, `pattern`, `min`, `max`) que reducen errores del usuario antes del envío del formulario."
        }
      ],
      "video": "",
      "dato": "Un formulario bien diseñado no solo recolecta datos, sino que guía, valida y mejora la experiencia del usuario."
    },
    {
      "id": 5,
      "title": "Multimedia, Semántica y Contenido Enriquecido",
      "description": "Descubre cómo HTML5 revolucionó la integración de contenido multimedia y la semántica en la web moderna.",
      "lecciones": [
        {
          "id": "e1",
          "title": "Audio y video nativos en HTML5",
          "explicacion": "Las etiquetas `<audio>` y `<video>` permiten insertar medios directamente sin complementos externos. Se pueden personalizar mediante atributos (`controls`, `autoplay`, `loop`) y controlar con JavaScript para crear reproductores personalizados."
        },
        {
          "id": "e2",
          "title": "Etiquetas semánticas y estructura lógica",
          "explicacion": "HTML5 introdujo etiquetas semánticas (`<header>`, `<footer>`, `<nav>`, `<article>`, `<section>`, `<aside>`) que definen mejor la intención del contenido, facilitando la comprensión por motores de búsqueda y tecnologías asistivas."
        },
        {
          "id": "e3",
          "title": "Contenido ilustrativo y descriptivo",
          "explicacion": "El uso de `<figure>` y `<figcaption>` permite agrupar medios con sus descripciones, añadiendo contexto semántico. Es una práctica recomendada para galerías, infografías y contenido visual educativo."
        }
      ],
      "video": "",
      "dato": "El contenido semántico y multimedia enriquece la experiencia del usuario y mejora la accesibilidad global del sitio."
    },
    {
      "id": 6,
      "title": "Buenas Prácticas, Accesibilidad y SEO Técnico",
      "description": "Aprenderás las normas que garantizan que tus documentos HTML sean válidos, accesibles, rápidos y optimizados para buscadores.",
      "lecciones": [
        {
          "id": "f1",
          "title": "Validación y estándares W3C",
          "explicacion": "Validar tu HTML con el W3C Markup Validator asegura conformidad con los estándares, evitando errores de interpretación en diferentes navegadores y dispositivos."
        },
        {
          "id": "f2",
          "title": "Accesibilidad y estándares WCAG",
          "explicacion": "La accesibilidad web (a11y) busca garantizar el acceso universal. HTML permite aplicar prácticas como texto alternativo (`alt`), etiquetas ARIA (`role`, `aria-label`) y navegación por teclado."
        },
        {
          "id": "f3",
          "title": "Optimización semántica y SEO técnico",
          "explicacion": "El uso adecuado de etiquetas (`<h1>` único, títulos claros, metaetiquetas y microdatos) mejora el posicionamiento en buscadores y la comprensión del contenido por parte de los bots."
        },
        {
          "id": "f4",
          "title": "Estructura limpia y mantenible",
          "explicacion": "Evita anidaciones incorrectas, repeticiones innecesarias y nombres de clases poco descriptivos. Comenta secciones clave y sigue una jerarquía clara para mantener un código legible y escalable."
        }
      ],
      "video": "",
      "dato": "La accesibilidad y las buenas prácticas no son opcionales: son el estándar de calidad profesional."
    },
    {
      "id": 7,
      "title": "Metadatos, Open Graph y Datos Estructurados",
      "description": "Aprende a definir metadatos técnicos y sociales para mejorar la visibilidad y presentación de tu sitio web en buscadores y redes sociales.",
      "lecciones": [
        {
          "id": "g1",
          "title": "Metaetiquetas esenciales para SEO",
          "explicacion": "Las metaetiquetas (`<meta>`) definen información como descripción, autor, idioma o viewport. Son clave para el SEO y la correcta visualización en diferentes dispositivos."
        },
        {
          "id": "g2",
          "title": "Open Graph y tarjetas de redes sociales",
          "explicacion": "Los protocolos Open Graph (Facebook, LinkedIn) y Twitter Cards permiten controlar cómo se muestran los enlaces compartidos en redes, definiendo imágenes, títulos y descripciones personalizadas."
        },
        {
          "id": "g3",
          "title": "Microdatos y marcado semántico con Schema.org",
          "explicacion": "Los microdatos estructurados (`itemscope`, `itemprop`) comunican a los motores de búsqueda el tipo de contenido (artículos, reseñas, eventos), mejorando el posicionamiento y la presentación en resultados enriquecidos."
        }
      ],
      "video": "",
      "dato": "Los metadatos y microdatos son el lenguaje que entiende Google para posicionar tu sitio correctamente."
    },
    {
      "id": 8,
      "title": "APIs de HTML5 y Funcionalidades Avanzadas",
      "description": "Explora las APIs modernas que amplían las capacidades del navegador, permitiendo experiencias más dinámicas e interactivas.",
      "lecciones": [
        {
          "id": "h1",
          "title": "API de geolocalización",
          "explicacion": "Permite obtener la posición geográfica del usuario con su consentimiento. Ideal para mapas, servicios locales o personalización de contenido. Se accede mediante `navigator.geolocation`."
        },
        {
          "id": "h2",
          "title": "Canvas y gráficos 2D",
          "explicacion": "El elemento `<canvas>` permite generar gráficos dinámicos, animaciones o visualizaciones en tiempo real controladas con JavaScript. Es ampliamente usado en dashboards y juegos web."
        },
        {
          "id": "h3",
          "title": "Almacenamiento local y persistencia de datos",
          "explicacion": "`localStorage` y `sessionStorage` permiten guardar datos directamente en el navegador, sin necesidad de cookies, facilitando experiencias personalizadas y aplicaciones offline."
        }
      ],
      "video": "",
      "dato": "Las APIs de HTML5 convierten la web en una plataforma de desarrollo completa y autosuficiente."
    },
    {
      "id": 9,
      "title": "Proyecto Final: Desarrollo de un Portfolio Profesional",
      "description": "Pondrás en práctica todos los conocimientos adquiridos creando un portfolio moderno, semántico y accesible.",
      "lecciones": [
        {
          "id": "i1",
          "title": "Arquitectura y diseño del proyecto",
          "explicacion": "Define la estructura del sitio, organiza secciones como ‘Sobre mí’, ‘Proyectos’, ‘Habilidades’ y ‘Contacto’. Planifica la jerarquía de encabezados y navegación."
        },
        {
          "id": "i2",
          "title": "Implementación con HTML5 semántico",
          "explicacion": "Aplica etiquetas semánticas y buenas prácticas de estructura para construir tu portfolio desde cero, siguiendo estándares profesionales."
        },
        {
          "id": "i3",
          "title": "Optimización y publicación",
          "explicacion": "Valida el HTML, añade metadatos, optimiza imágenes, prueba accesibilidad y publica tu sitio en plataformas como GitHub Pages, Netlify o Vercel."
        }
      ],
      "video": "",
      "dato": "Un portfolio bien construido es tu carta de presentación profesional en el mundo del desarrollo web."
    }
  ]
}
