{
    "id": "html",
    "name": "Curso intensivo de HTML5",
    "description": "Aprende a elaborar plataformas webs, armando su esqueleto ☠.",
    "modulos": [
        {
            "id": 1,
            "title": "Conceptos y explicaciones",
            "description": "Aprenderás lo básico, además de manejar los principales conceptos de este lenguaje.",
            "lecciones": [
                {
                    "id": "a1",
                    "title": "¿Qué es HTML?",
                    "explicacion": "HTML son las siglas de HyperText Markup Language (Lenguaje de Marcado de Hipertexto), el lenguaje estándar para crear y estructurar el contenido de las páginas web. Se utiliza para organizar elementos como texto, encabezados, imágenes y enlaces, indicando a los navegadores cómo mostrar la información de forma organizada. A diferencia de los lenguajes de programación, su función es la de dar estructura al contenido, no realizar cálculos."
                },
                {
                    "id": "a2",
                    "title": "¿Cómo funciona?",
                    "explicacion": "HTML utiliza un sistema de 'etiquetas' o 'marcas' para definir los diferentes componentes de una página.  Cada etiqueta indica el tipo de contenido y su función. Por ejemplo, la etiqueta `<h1>` se usa para un título principal y `<p>` para un párrafo. Un elemento HTML se compone típicamente de una etiqueta de apertura, el contenido y una etiqueta de cierre. Por ejemplo: `<p>Este es un párrafo</p>`. Los archivos HTML se identifican con las extensiones `.html` o `.htm` y pueden ser creados con un editor de texto simple o software de diseño web especializado."
                },
                {
                    "id": "a3",
                    "title": "¿Para qué sirve?",
                    "explicacion": "Proporciona el marco fundamental de cualquier página web, organizando texto, imágenes, tablas, formularios y otros elementos. Le indica al navegador web cómo debe mostrar los elementos, desde la tipografía hasta la disposición de los elementos multimedia. Es el primer paso y la base de todo el desarrollo web moderno, permitiendo la creación de sitios web en cualquier plataforma."
                },
                {
                    "id": "a4",
                    "title": "Evolución de HTML",
                    "explicacion": "Desde HTML 1.0 hasta HTML5, este lenguaje ha evolucionado para adaptarse a nuevas necesidades. HTML5 introdujo etiquetas semánticas, soporte multimedia nativo, y compatibilidad con APIs modernas como geolocalización y canvas, revolucionando el desarrollo web."
                }
            ],
            "video": "",
            "dato": "HTML, no es un lenguaje de programación, ya que se especializa en el marcado, para realizar la estructura de una web."
        },
        {
            "id": 2,
            "title": "Anatomía de un documento HTML5",
            "description": "Exploraremos las partes esenciales de una página web, desde la declaración del tipo de documento hasta los metadatos y el cuerpo visible.",
            "lecciones": [
                {
                    "id": "b1",
                    "title": "Estructura básica de un documento HTML",
                    "explicacion": "Un documento HTML5 tiene una estructura estándar que incluye la declaración `<!DOCTYPE html>`, la etiqueta raíz `<html>`, y sus dos secciones principales: la cabecera `<head>` y el cuerpo `<body>`. La correcta anidación de estas etiquetas es fundamental para el funcionamiento y la correcta interpretación de la página por el navegador."
                },
                {
                    "id": "b2",
                    "title": "La cabecera (<head>)",
                    "explicacion": "La sección `<head>` contiene información que no se muestra directamente en la página, pero es vital para su funcionamiento. Aquí se definen metadatos como el título de la página (`<title>`), la codificación de caracteres (`<meta charset='utf-8'>`), y se enlazan recursos externos como hojas de estilo (`<link>`) y scripts de JavaScript."
                },
                {
                    "id": "b3",
                    "title": "El cuerpo (<body>)",
                    "explicacion": "La sección `<body>` es el corazón del documento, ya que contiene todo el contenido que el usuario puede ver e interactuar: texto, imágenes, videos, formularios, y otros elementos. Es donde se construye la interfaz visual de la página web."
                },
                {
                    "id": "b4",
                    "title": "Comentarios en HTML",
                    "explicacion": "Los comentarios se escriben con `<!-- comentario -->` y sirven para dejar notas dentro del código que no son visibles para el usuario. Son útiles para documentar partes del código o desactivar temporalmente secciones."
                }
            ],
            "video": "https://fwfnrpvtldgyvgorzwrp.supabase.co/storage/v1/object/public/Videos/html_1.mp4",
            "dato": "Las etiquetas `<head>` y `<body>` son hijos directos de la etiqueta `<html>`, definiendo la estructura semántica principal del documento."
        },
        {
            "id": 3,
            "title": "Etiquetas y elementos básicos",
            "description": "Aprenderás las etiquetas fundamentales para estructurar textos, enlaces, imágenes y listas en HTML.",
            "lecciones": [
                {
                    "id": "c1",
                    "title": "Encabezados y párrafos",
                    "explicacion": "Los encabezados se crean con `<h1>` a `<h6>` para jerarquizar la información, y los párrafos con `<p>`. Mantener una estructura clara mejora la accesibilidad y SEO de la página."
                },
                {
                    "id": "c2",
                    "title": "Enlaces",
                    "explicacion": "Los enlaces se crean con la etiqueta `<a>`. Por ejemplo: `<a href='https://www.ejemplo.com'>Visitar ejemplo</a>`. Permiten navegar entre páginas o secciones dentro de un mismo sitio."
                },
                {
                    "id": "c3",
                    "title": "Imágenes",
                    "explicacion": "Se utilizan con la etiqueta `<img>` indicando la ruta de la imagen y atributos como `alt` para describirla. Por ejemplo: `<img src='foto.jpg' alt='Foto de ejemplo'>`."
                },
                {
                    "id": "c4",
                    "title": "Listas",
                    "explicacion": "HTML permite listas ordenadas (`<ol>`) y desordenadas (`<ul>`), con elementos `<li>`. Son útiles para organizar información de manera clara y jerárquica."
                },
                {
                    "id": "c5",
                    "title": "Tablas básicas",
                    "explicacion": "Las tablas se crean con `<table>`, `<tr>` para filas, `<th>` para encabezados y `<td>` para celdas de datos. Son útiles para mostrar información tabular como horarios o comparaciones."
                }
            ],
            "video": "",
            "dato": "Aprender estas etiquetas es clave para construir cualquier página web básica."
        },
        {
            "id": 4,
            "title": "Formularios y controles de usuario",
            "description": "Exploraremos cómo crear formularios para interactuar con los usuarios mediante campos de texto, botones y selección de opciones.",
            "lecciones": [
                {
                    "id": "d1",
                    "title": "Introducción a los formularios",
                    "explicacion": "Los formularios se crean con la etiqueta `<form>` y permiten recolectar datos de los usuarios, que luego pueden enviarse a un servidor para su procesamiento."
                },
                {
                    "id": "d2",
                    "title": "Campos de texto y botones",
                    "explicacion": "Se usan `<input type='text'>` para texto, `<input type='password'>` para contraseñas y `<button>` o `<input type='submit'>` para enviar el formulario."
                },
                {
                    "id": "d3",
                    "title": "Checkboxes, radios y select",
                    "explicacion": "Checkboxes (`<input type='checkbox'>`) permiten seleccionar múltiples opciones; radios (`<input type='radio'>`) solo una; y `<select>` crea menús desplegables para elegir entre varias opciones."
                },
                {
                    "id": "d4",
                    "title": "Etiquetas y agrupaciones",
                    "explicacion": "Se usa `<label>` para asociar textos con campos y `<fieldset>` junto con `<legend>` para agrupar campos relacionados, mejorando la accesibilidad del formulario."
                }
            ],
            "video": "",
            "dato": "Los formularios son esenciales para cualquier interacción avanzada en la web."
        },
        {
            "id": 5,
            "title": "Multimedia y elementos semánticos",
            "description": "Aprenderás a integrar imágenes, audio, video y otros elementos semánticos que mejoran la accesibilidad y organización de tu web.",
            "lecciones": [
                {
                    "id": "e1",
                    "title": "Insertar imágenes, audio y video",
                    "explicacion": "Además de `<img>`, HTML5 incluye `<audio>` y `<video>` para incorporar medios directamente en la página, con controles y opciones de reproducción."
                },
                {
                    "id": "e2",
                    "title": "Elementos semánticos",
                    "explicacion": "HTML5 introdujo etiquetas como `<header>`, `<footer>`, `<article>` y `<section>` para estructurar mejor el contenido y facilitar la accesibilidad y el SEO."
                },
                {
                    "id": "e3",
                    "title": "El elemento <figure> y <figcaption>",
                    "explicacion": "Se utilizan para agrupar imágenes con sus descripciones o créditos, mejorando la presentación semántica y la comprensión del contenido visual."
                }
            ],
            "video": "",
            "dato": "Usar elementos semánticos hace que tu página sea más comprensible para navegadores, buscadores y lectores de pantalla."
        },
        {
            "id": 6,
            "title": "Buenas prácticas y accesibilidad",
            "description": "Conocerás las normas de HTML que mejoran la calidad del código, la experiencia del usuario y la accesibilidad de tu web.",
            "lecciones": [
                {
                    "id": "f1",
                    "title": "Validación de HTML",
                    "explicacion": "Es importante validar el HTML para asegurarse de que el código cumple con los estándares y se visualiza correctamente en todos los navegadores."
                },
                {
                    "id": "f2",
                    "title": "Accesibilidad web",
                    "explicacion": "Usar etiquetas correctas, descripciones `alt` para imágenes, títulos claros y estructura semántica permite que personas con discapacidades puedan navegar tu web."
                },
                {
                    "id": "f3",
                    "title": "Optimización y SEO básico",
                    "explicacion": "Mantener un código limpio, utilizar títulos descriptivos y metaetiquetas ayuda a que los motores de búsqueda indexen mejor tu sitio y mejore su rendimiento."
                },
                {
                    "id": "f4",
                    "title": "Buenas prácticas de estructura",
                    "explicacion": "Evita anidar etiquetas incorrectamente, usa comentarios para documentar y mantén un orden lógico en tu código para facilitar el mantenimiento."
                }
            ],
            "video": "https://fwfnrpvtldgyvgorzwrp.supabase.co/storage/v1/object/public/Videos/html_2.mp4",
            "dato": "La accesibilidad y buenas prácticas no solo son éticas, sino que también potencian la visibilidad de tu web."
        },
        {
            "id": 7,
            "title": "Metadatos y SEO avanzado",
            "description": "Aprende a usar metadatos y microdatos para mejorar la visibilidad y comprensión de tu web por los motores de búsqueda.",
            "lecciones": [
                {
                    "id": "g1",
                    "title": "Metaetiquetas básicas",
                    "explicacion": "Las metaetiquetas proporcionan información sobre la página. Por ejemplo, `<meta name='description' content='Curso de HTML5'>` ayuda a los buscadores a entender de qué trata tu sitio."
                },
                {
                    "id": "g2",
                    "title": "Open Graph y Twitter Cards",
                    "explicacion": "Permiten que tus enlaces se vean bien al compartirse en redes sociales, mostrando títulos, descripciones e imágenes personalizadas."
                },
                {
                    "id": "g3",
                    "title": "Microdatos y Schema.org",
                    "explicacion": "Ayudan a los motores de búsqueda a entender mejor tu contenido mediante marcado estructurado, lo cual mejora la apariencia de tus resultados en Google."
                }
            ],
            "video": "",
            "dato": "Los metadatos y microdatos hacen que tu web destaque en los resultados de búsqueda."
        },
        {
            "id": 8,
            "title": "HTML5 APIs y características avanzadas",
            "description": "Explora las nuevas funcionalidades que hacen de HTML5 una herramienta poderosa e interactiva.",
            "lecciones": [
                {
                    "id": "h1",
                    "title": "API de geolocalización",
                    "explicacion": "Permite obtener la ubicación del usuario con su permiso. Útil para mapas, servicios locales o personalización de contenido."
                },
                {
                    "id": "h2",
                    "title": "Canvas y gráficos 2D",
                    "explicacion": "La etiqueta `<canvas>` permite dibujar gráficos, animaciones o juegos directamente desde el navegador usando JavaScript."
                },
                {
                    "id": "h3",
                    "title": "Almacenamiento local (LocalStorage y SessionStorage)",
                    "explicacion": "Permite guardar datos del usuario directamente en el navegador, sin necesidad de cookies. Ideal para aplicaciones offline o recordar preferencias."
                }
            ],
            "video": "",
            "dato": "Las APIs de HTML5 te permiten crear experiencias web dinámicas sin depender de plugins externos."
        },
        {
            "id": 9,
            "title": "Proyecto final: Construcción de un portfolio personal.",
            "description": "Aplicarás todo lo aprendido para crear tu propio sitio web de portfolio, mostrando tus habilidades y comentando sobre tí.",
            "lecciones": [
                {
                    "id": "i1",
                    "title": "Planificación del portfolio",
                    "explicacion": "Define la estructura y contenido, destacando tus habilidades y proyectos."
                },
                {
                    "id": "i2",
                    "title": "Desarrollo del sitio web",
                    "explicacion": "Utiliza HTML5 para construir las diferentes secciones de tu portfolio, aplicando las mejores prácticas aprendidas."
                },
                {
                    "id": "i3",
                    "title": "Optimización y publicación",
                    "explicacion": "Valida tu código, optimiza para SEO y publica tu portfolio en una plataforma de hosting."
                }
            ],
            "video": "",
            "dato": "Un portfolio bien diseñado es clave para mostrar tus habilidades y atraer oportunidades profesionales."
        }
    ]
}